Autodesk.Revit.DB.WallFunction
Indicates the function of a specified WallType, as specified in the parameter FUNCTION_PARAM on the WallType.

Autodesk.Revit.DB.WallFunction.Coreshaft
A coreshaft wall.

Autodesk.Revit.DB.WallFunction.Soffit
A soffit wall.

Autodesk.Revit.DB.WallFunction.Retaining
A retaining wall.

Autodesk.Revit.DB.WallFunction.Foundation
A foundation wall.

Autodesk.Revit.DB.WallFunction.Exterior
An exterior wall.

Autodesk.Revit.DB.WallFunction.Interior
An interior wall.